
# 两次爬虫之间的间隔，建议尽量设大一点，如果不怕出问题可以设小（update:设小了会触发过于频繁的报错，尚未测试下界）
INTV = 10

# 当前学期
XNXQ = '2023-2024-2'

#所有课程类型
XWK  = 0	#学位课
FXWK = 1	#非学位课
TYK  = 2	#研究生体育
CNUM = 3

# 要选的课程，格式为 '课程号,课序号,课程类型（见上面）'
# 按照round-robin依次尝试，直至选上或报错
COURSES = [
	#('60230014', '200', XWK ),
	#('14205174', '101', FXWK),
	#('14205174', '100', FXWK),
	#('60720030', '200', TYK ),
	#('60720290', '2'  , TYK ),
]

# 是否尝试登录
TRY_LOGIN = True

# 若不尝试登录，需要填写以下值
# 从浏览器的cookies获取
JSESSIONID = '' #'eca-qpCcGPz646CGSk_uy'
SERVERID = '' #'1325456'

# 若尝试登录，需要填写以下值
# 用户名密码，登录时需要用到
USER_NAME = '' #'xxx22'
PASSWORD = '' #'password'
